jimmywong2003/nrf52_ble_transfer_jpg/ble_app_transfer_jpg/main.c
        uint32_t err_code = NRF_SUCCESS;
        //NRF_LOG_HEXDUMP_INFO(p_data, length);
        switch(p_data[0])
        {
        // Take picture
        case APP_CMD_SINGLE_CAPTURE:
        case APP_CMD_SEND_BLE_PARAMS:
                m_new_command_received = p_data[0];

                NRF_LOG_INFO("APP_CMD_SINGLE_CAPTURE");
                err_code = app_sched_event_put(NULL, 0, its_data_file_test);
                APP_ERROR_CHECK(err_code);


                break;

        case APP_CMD_START_STREAM:
                m_stream_mode_active = true;
                m_new_command_received = p_data[0];
                break;

        case APP_CMD_STOP_STREAM:
                m_stream_mode_active = false;
                m_new_command_received = p_data[0];
                break;

        case APP_CMD_CHANGE_RESOLUTION:
                m_new_command_received = APP_CMD_CHANGE_RESOLUTION;
                m_new_resolution = p_data[1];
                break;

        case APP_CMD_CHANGE_PHY:
                m_new_command_received = APP_CMD_CHANGE_PHY;
                m_new_phy = p_data[1];
                break;

        default:
                NRF_LOG_ERROR("Unknown command!!");
                break;
        }
}

static void JPG_Transfer_state_machine(void)
{
        uint32_t new_command = m_new_command_received;
        m_new_command_received = APP_CMD_NOCOMMAND;
        uint32_t image_size;
        switch(new_command)
        {
        case APP_CMD_SINGLE_CAPTURE:
                if(arducam_mini_2mp_bytesAvailable() == 0)
                {
                        NRF_LOG_INFO("Starting capture...");
//                        arducam_mini_2mp_startSingleCapture();
//                        image_size = arducam_mini_2mp_bytesAvailable();
                        NRF_LOG_INFO("Capture complete: size %i bytes", (int)(image_size));
                        ble_its_img_info_t image_info;
                        image_info.file_size_bytes = image_size - 1;
                        ble_its_img_info_send(&m_its, &image_info);

//                        // Flush the first byte (or the JPG image will be corrupted)
//                        arducam_mini_2mp_fillBuffer(img_data_buffer, 1);
                }
                break;

//                case APP_CMD_START_STREAM:
//                    NRF_LOG_INFO("Stream mode enabled");
//                    break;
//
//                case APP_CMD_STOP_STREAM:
//                    NRF_LOG_INFO("Stream mode disabled");
//                    break;

//                case APP_CMD_CHANGE_RESOLUTION:
//                    NRF_LOG_INFO("Change resolution to mode: %i", (int)m_new_resolution);
//                    switch(m_new_resolution)
//                    {
//                        case 0:
//                            arducam_mini_2mp_setResolution(OV2640_160x120);
//                            break;
//
//                        case 1:
//                            arducam_mini_2mp_setResolution(OV2640_320x240);
//                            break;
//
//                        case 2:
//                            arducam_mini_2mp_setResolution(OV2640_640x480);
//                            break;
//
//                        case 3:
//                            arducam_mini_2mp_setResolution(OV2640_800x600);
//                            break;
//
//                        case 4:
//                            arducam_mini_2mp_setResolution(OV2640_1024x768);
//                            break;
//
//                        case 5:
//                            arducam_mini_2mp_setResolution(OV2640_1600x1200);
//                            break;
//
//                    }
//                    break;
//
//                case APP_CMD_CHANGE_PHY:
//                    NRF_LOG_INFO("Attempting to change phy.");
//                    gap_phys_settings.tx_phys = (m_new_phy == 0 ? BLE_GAP_PHY_1MBPS : BLE_GAP_PHY_2MBPS);
//                    gap_phys_settings.rx_phys = (m_new_phy == 0 ? BLE_GAP_PHY_1MBPS : BLE_GAP_PHY_2MBPS);
//
//                    sd_ble_gap_phy_update(m_its.conn_handle, &gap_phys_settings);
//                    break;

        case APP_CMD_SEND_BLE_PARAMS:
                ble_its_ble_params_info_send(&m_its, &m_ble_params_info);
                break;

        default:
                break;

        }
}


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
        ret_code_t err_code;
        nrf_ble_qwr_init_t qwr_init = {0};
        ble_nus_init_t nus_init;
        ble_its_init_t its_init;

        // Initialize Queued Write Module.
        qwr_init.error_handler = nrf_qwr_error_handler;

        err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
        APP_ERROR_CHECK(err_code);

//
//        // Initialize NUS.
//        memset(&nus_init, 0, sizeof(nus_init));
//
//        nus_init.data_handler = nus_data_handler;
//
//        err_code = ble_nus_init(&m_nus, &nus_init);
//
//        APP_ERROR_CHECK(err_code);

        // Initialize ITS.
        memset(&its_init, 0, sizeof(its_init));

        its_init.data_handler = its_data_handler;

        err_code = ble_its_init(&m_its, &its_init);
        APP_ERROR_CHECK(err_code);



}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module that
 *          are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply
 *       setting the disconnect_on_fail config parameter, but instead we use the event
 *       handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
        ret_code_t err_code;

        if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
        {
                err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
                APP_ERROR_CHECK(err_code);
        }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
        ret_code_t err_code;
        ble_conn_params_init_t cp_init;

        memset(&cp_init, 0, sizeof(cp_init));

        cp_init.p_conn_params                  = NULL;
        cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
        cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
        cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
        cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
        cp_init.disconnect_on_fail             = false;
        cp_init.evt_handler                    = on_conn_params_evt;
        cp_init.error_handler                  = conn_params_error_handler;

